## Import Libraries

In [27]:
import pandas as pd
import numpy as np
import os

## Import Data

In [29]:
path = r"C:\Users\Zachu\Downloads\08-25-2024_Insta_Cart_Basket_Analysis"
c_data = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'customers', 'customers.csv'))

In [31]:
c_data.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

## 04. Wrangle data

In [15]:
# Create conistent column names

In [33]:
c_data.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'surname', 'Gender': 'gender', 'STATE':'state', 'Age':'age', 'n_dependants': 'number_dependents', 'fam_status': 'family_status' }, inplace=True)
c_data.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'number_dependents', 'family_status', 'income'],
      dtype='object')

In [19]:
# Create a data subset for users by region

In [35]:
c_data_sw = c_data[c_data['state'].isin(['California', 'Arizona', 'Nevada', 'New Mexico', 'Colorado', 'Utah'])]
c_data_sw.head(10)

,user_id,first_name,surname,gender,state,age,date_joined,number_dependents,family_status,income
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
10,26441,Gloria,Stafford,Female,Nevada,19,1/1/2017,2,living with parents and siblings,43443
14,516,Peter,Hunt,Male,Colorado,51,1/1/2017,2,married,146559
32,112664,Nicholas,Logan,Male,California,64,1/1/2017,3,married,111354
37,139692,Barbara,Chang,Female,Arizona,54,1/1/2017,3,married,113960
51,19658,Sara,Diaz,Female,Nevada,50,1/1/2017,1,married,143086
52,69366,Carlos,Eaton,Male,Colorado,30,1/1/2017,2,married,99478
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
55,54950,Steve,Tanner,Male,Nevada,66,1/1/2017,0,divorced/widowed,138170
61,153147,Frank,Howell,Male,Utah,48,1/1/2017,1,married,128416

In [37]:
c_data_sw.shape

(24261, 10)

## 05. Data consistency checks

In [39]:
c_data.isnull().sum()

user_id                  0
first_name           11259
surname                  0
gender                   0
state                    0
age                      0
date_joined              0
number_dependents        0
family_status            0
income                   0
dtype: int64

In [53]:
rows_with_nulls = c_data[c_data.isnull().any(axis=1)]

In [55]:
rows_with_nulls.head(10)

,user_id,first_name,surname,gender,state,age,date_joined,number_dependents,family_status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
128,8562,NaN,Oconnor,Male,Utah,46,1/1/2017,1,married,134898
140,149267,NaN,Hutchinson,Male,South Carolina,20,1/1/2017,0,single,86778
149,82632,NaN,Orr,Male,Hawaii,61,1/1/2017,1,married,118130
155,172331,NaN,Williamson,Female,Alaska,27,1/1/2017,0,single,55047
236,182963,NaN,Nicholson,Female,New Mexico,58,1/2/2017,1,married,163391

In [58]:
# Look at data types of dataset

In [59]:
c_data.dtypes

user_id               int64
first_name           object
surname              object
gender               object
state                object
age                   int64
date_joined          object
number_dependents     int64
family_status        object
income                int64
dtype: object

In [60]:
# Change user ID from int value to string since it's categorical

In [61]:
c_data['user_id'] = c_data['user_id'].astype('str')

In [62]:
# Check for mixed data types in columns

In [63]:
for col in c_data.columns.tolist():
    weird = (c_data[[col]].applymap(type) != c_data[[col]].iloc[0].apply(type)).any(axis=1)
    if len(c_data[weird]) > 0:
        print(col)

C:\Users\Zachu\AppData\Local\Temp\ipykernel_9596\1851826724.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (c_data[[col]].applymap(type) != c_data[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Zachu\AppData\Local\Temp\ipykernel_9596\1851826724.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (c_data[[col]].applymap(type) != c_data[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Zachu\AppData\Local\Temp\ipykernel_9596\1851826724.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (c_data[[col]].applymap(type) != c_data[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Zachu\AppData\Local\Temp\ipykernel_9596\1851826724.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (c_data[[col]].applymap(type) != c_data[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Zachu\AppData\Local\Temp\ipykernel_9596\1851826724.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (c_data[[col]].applymap(type) != c_data[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Zachu\AppData\Local\Temp\ipykernel_9596\1851826724.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (c_data[[col]].applymap(type) != c_data[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Zachu\AppData\Local\Temp\ipykernel_9596\1851826724.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (c_data[[col]].applymap(type) != c_data[[col]].iloc[0].apply(type)).any(axis=1)

first_name

C:\Users\Zachu\AppData\Local\Temp\ipykernel_9596\1851826724.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (c_data[[col]].applymap(type) != c_data[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Zachu\AppData\Local\Temp\ipykernel_9596\1851826724.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (c_data[[col]].applymap(type) != c_data[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Zachu\AppData\Local\Temp\ipykernel_9596\1851826724.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (c_data[[col]].applymap(type) != c_data[[col]].iloc[0].apply(type)).any(axis=1)

In [64]:
# Convert 'first_name'column to string value

In [65]:
c_data['first_name'] = c_data['first_name'].astype('str')

In [66]:
c_data.dtypes

user_id              object
first_name           object
surname              object
gender               object
state                object
age                   int64
date_joined          object
number_dependents     int64
family_status        object
income                int64
dtype: object

In [69]:
# Find missing and duplicate values

In [70]:
c_data.isnull().sum()

user_id              0
first_name           0
surname              0
gender               0
state                0
age                  0
date_joined          0
number_dependents    0
family_status        0
income               0
dtype: int64

In [71]:
c_data.duplicated().sum()

0

In [72]:
c_data_dups = c_data[c_data.duplicated()]
c_data_dups.head(10)

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, number_dependents, family_status, income]
Index: []

In [73]:
# No missing or duplicate values present

In [74]:
# Create value counts for gender, family status and state and create descriptive stats for continuous variables

In [75]:
c_data['gender'].value_counts(dropna=False)

gender
Male      104067
Female    102142
Name: count, dtype: int64

In [76]:
c_data['family_status'].value_counts(dropna=False)

family_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

In [77]:
c_data['state'].value_counts(dropna=False)

state
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

In [78]:
c_data.describe()

                 age  number_dependents         income
count  206209.000000      206209.000000  206209.000000
mean       49.501646           1.499823   94632.852548
std        18.480962           1.118433   42473.786988
min        18.000000           0.000000   25903.000000
25%        33.000000           0.000000   59874.000000
50%        49.000000           1.000000   93547.000000
75%        66.000000           3.000000  124244.000000
max        81.000000           3.000000  593901.000000

In [79]:
# No irregularities with categorical or number variables

## 06. Combining dataframes

In [81]:
# Importing dataframe

In [121]:
df = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_merged_aggregated_small.pkl'))

In [83]:
# Combining dataframes

In [123]:
merged_df = pd.merge(df, c_data, on='user_id', how='inner')

In [125]:
merged_df.to_pickle(os.path.join(path, 'Data', 'Prepared Data', 'merged_c_data_small.pkl'))